---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooSparseSpacing
source: html/b8d7ea03-8f93-f512-3313-4d179775f3e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooSparseSpacing Property

Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId BarsTooSparseSpacing { get; }
```